[
  {
    "id": 0,
    "text": "Real estate giant K Raheja eyes $700 million IPO. K Raheja Corp plans a $700 million IPO, potentially becoming India's largest real estate listing amid robust market activity.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/india-property-developer-k-raheja-said-to-weigh-700-million-ipo",
    "source": "Bloomberg"
  },
  {
    "id": 1,
    "text": "Tata Motors eyes bid for 6,000 e-buses without joining price wars. Tata Motors Ltd is preparing to bid for a government tender of as many as 6,000 electric buses, as it seeks to claw back market share without joining the steep discounting that has defined recent auctions, its top official said.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/tata-eyes-bid-for-6-000-e-buses-without-joining-price-wars",
    "source": "Bloomberg"
  },
  {
    "id": 2,
    "text": "India allows some exports of wheat products after three-year ban. India’s decision to restart some exports, which were halted in May 2022, coincides with the country’s trade talks with the US",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/india-allows-some-exports-of-wheat-products-after-three-year-ban",
    "source": "Bloomberg"
  },
  {
    "id": 3,
    "text": "The list of people invited to Trump’s Board of Peace for Gaza. Trump wants the signing ceremony to take place in Davos on Thursday, despite calls from some of those invited to rewrite the terms of the panel",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/the-list-of-people-invited-to-trump-s-board-of-peace-for-gaza",
    "source": "Bloomberg"
  },
  {
    "id": 4,
    "text": "Silver hits record high as US-EU crisis over Greenland simmers. The US’s aggression toward its NATO allies has rattled markets, buoying demand for havens and reviving the ‘Sell America’ trade",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/silver-rises-to-record-as-us-eu-tensions-over-greenland-persist",
    "source": "Bloomberg"
  },
  {
    "id": 5,
    "text": "RBI needs to ramp up bond purchases to cool yields, funds say. RBI has injected a record 14.5 trillion rupees of liquidity since end-December 2024 through cash reserve-ratio cuts, open-market bond purchases and foreign-exchange swaps,",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-20/rbi-needs-to-ramp-up-bond-purchases-to-cool-yields-funds-say",
    "source": "Bloomberg"
  },
  {
    "id": 6,
    "text": "EU eyes tariffs on €93 billion of US goods over Trump’s latest 10% levy threat. The European Union is in talks to potentially impose tariffs on €93 billion ($108 billion) of US goods if President Donald Trump follows through on his threat to hit European countries with a 10 per cent levy on Feb. 1.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/eu-eyes-tariffs-on-93-billion-of-us-goods-over-new-trump-threat",
    "source": "Bloomberg"
  },
  {
    "id": 7,
    "text": "Jane Street’s India unit saw trading gains soar 494% before curbs. The financial results cast new light on the scale of Jane Street’s trading operations in India, where the company is currently facing investigations by the stock market regulator.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-19/jane-street-india-unit-saw-trading-gains-soar-494-before-curbs",
    "source": "Bloomberg"
  },
  {
    "id": 8,
    "text": "Govt green-lights plan to buy 114 French Rafale jets. The purchase would be a significant upgrade for the Indian Air Force, whose fighter fleet, largely of Russian origin, is dwindling",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/india-inches-closer-to-buying-114-french-rafale-jets",
    "source": "Bloomberg"
  },
  {
    "id": 9,
    "text": "Walmart’s CEO of international business to depart company. Walmart's international CEO, Kathryn McLay, is stepping down; a successor will be named soon as leadership transitions.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/walmart-says-its-international-ceo-is-leaving-company",
    "source": "Bloomberg"
  },
  {
    "id": 10,
    "text": "Mitsubishi to buy Aethon US gas assets in $5.2 billion deal. Mitsubishi acquires Aethon Energy's US gas assets for $5.2 billion, marking a major investment in American shale.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/mitsubishi-to-buy-us-gas-assets-from-aethon-in-5-2-billion-deal",
    "source": "Bloomberg"
  },
  {
    "id": 11,
    "text": "Global corporate bond yield premiums fall to lowest since 2007. Money managers have been diving into the rally in credit due to the prospects of interest-rate cuts by the Federal Reserve and some other central banks",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-16/global-corporate-bond-yield-premiums-fall-to-lowest-since-2007",
    "source": "Bloomberg"
  },
  {
    "id": 12,
    "text": "Silver dips after US tariff pause, but set for hefty weekly gain. Silver prices dip after the US pauses tariffs but still achieve a significant weekly gain amid high demand.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/silver-dips-after-us-pause-on-critical-minerals-import-tariff",
    "source": "Bloomberg"
  },
  {
    "id": 13,
    "text": "Tesla’s India letdown spurs discounts on unsold Model Y SUVs. The tepid India debut comes at a time when the company is seeing faltering global demand. Its worldwide sales fell in 2025 for a second consecutive year, dropping the company behind China’s BYD Co. as the top-seller of EVs.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/tesla-s-india-letdown-spurs-discounts-on-unsold-model-y-suvs",
    "source": "Bloomberg"
  },
  {
    "id": 14,
    "text": "China bans cybersecurity products from top US, Israeli firms. Chinese companies’ use of such products could result in sensitive data being sent overseas or create other vulnerabilities for customers, says government directive",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/china-bans-cyber-products-from-top-us-israeli-security-firms",
    "source": "Bloomberg"
  },
  {
    "id": 15,
    "text": "US visa crackdown: A list of the 75 countries affected. US suspends immigrant visa processing for 75 countries starting January 21, intensifying its immigration crackdown.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-15/here-s-the-list-of-75-countries-affected-by-us-visa-crackdown",
    "source": "Bloomberg"
  },
  {
    "id": 16,
    "text": "US set to suspend visa processing for dozens of countries. While citizens of Afghanistan, Iran, Russia and Somalia already have little chance of getting a US visa, the move is likely to shut the door for people from nations such as Brazil",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/us-freezes-visa-processing-for-dozens-of-countries-fox-reports",
    "source": "Bloomberg"
  },
  {
    "id": 17,
    "text": "Bitcoin rally sees $600 million in bearish crypto bets wiped out. Bitcoin slumped to a loss of more than 6% for 2025 after ending the year in muted fashion, trading in a narrow range and proving largely indifferent to rallies in stocks and precious metals",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-14/bitcoin-btc-claims-two-month-high-of-over-96-000-on-macro-tailwinds",
    "source": "Bloomberg"
  },
  {
    "id": 18,
    "text": "Aluminium, copper settle after bull run into 2026. Aluminium and copper prices stabilize after a bullish run, amid concerns over demand and geopolitical risks impacting the metals market.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/aluminum-near-record-high-and-tin-extends-surge-on-supply-angst",
    "source": "Bloomberg"
  },
  {
    "id": 19,
    "text": "GA-backed Acko eyes banks for $350 million IPO. Acko is expected to appoint advisers in the coming weeks, they said. Deliberations are ongoing and the terms of the potential offering could still change",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/ga-backed-acko-said-to-seek-banks-for-350-million-india-ipo",
    "source": "Bloomberg"
  },
  {
    "id": 20,
    "text": "China examines foreign ETF trades after Jane Street India probe. China is investigating foreign ETF trades by Jane Street following regulatory issues in India, prompting UBS to pause some transactions.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/china-examines-foreign-etf-trades-after-jane-street-india-probe",
    "source": "Bloomberg"
  },
  {
    "id": 21,
    "text": "India’s debt fund managers turn tactical as returns get harder. This marks a shift in their strategy from last year when money managers largely preferred longer duration, as the Reserve Bank of India slashed rates by 125 basis points",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-13/india-s-debt-fund-managers-turn-tactical-as-returns-get-harder",
    "source": "Bloomberg"
  },
  {
    "id": 22,
    "text": "Deutsche bank’s $2.5 billion India retail assets draw final bids. Deutsche Bank's $2.5 billion retail assets in India attract bids from Kotak Mahindra Bank and Federal Bank amid market shifts.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-12/deutsche-bank-s-2-5-billion-india-retail-assets-draw-final-bids",
    "source": "Bloomberg"
  },
  {
    "id": 23,
    "text": "Reliance halts cell-making plans after failed bid for China tech. China has stepped up scrutiny of clean-energy technology deals as it seeks to protect strategic advantages in sectors, complicating localization efforts by foreign manufacturer",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-12/reliance-halts-cell-making-plans-after-failed-bid-for-china-tech",
    "source": "Bloomberg"
  },
  {
    "id": 24,
    "text": "Nvidia, Tesla chase same self-driving goal via varying paths. Nvidia wants to supply the intelligence layer for autonomy without building the car itself, but it still wants to own the technology that makes self-driving a reality",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-10/nvidia-and-tesla-chase-same-self-driving-goal-via-varying-paths",
    "source": "Bloomberg"
  },
  {
    "id": 25,
    "text": "Traders send stocks to fresh highs in strong first week of 2026. Investors also delved into other areas of the market, including small-caps and so-called value stocks, traditionally a sign of confidence in the economy.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/stocks-rise-as-traders-weigh-jobs-data-brace-for-tariff-ruling",
    "source": "Bloomberg"
  },
  {
    "id": 26,
    "text": "Gold investors stay bullish after record rally in 2025. Bloomberg spoke with more than a dozen money managers, whose firms collectively handle trillions of dollars of assets, to gauge sentiment after the historic year. Most of them said they’ve opted not to take too much money off the table, holding conviction in …",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-10/gold-investors-stay-bullish-after-record-rally-in-2025",
    "source": "Bloomberg"
  },
  {
    "id": 27,
    "text": "India’s record rice crop is set to deepen slide in global prices. Indian farmers are wrapping up another bumper rice harvest, adding a wave of grain to the global market that’s already well supplied and likely putting further pressure on benchmark prices.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/india-s-record-rice-crop-is-set-to-deepen-slide-in-global-prices",
    "source": "Bloomberg"
  },
  {
    "id": 28,
    "text": "Reliance Industries sees $15 billion market cap erosion at start of 2026. Investor sentiment has also cooled after retailers flagged weaker consumer demand and a US senator proposed legislation targeting buyers of Russian crude",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/reliance-slides-6-in-bruising-start-to-year-ahead-of-earnings",
    "source": "Bloomberg"
  },
  {
    "id": 29,
    "text": "NaBFID boosts derivatives use as falling rates squeeze margins. The infra lender has entered into swap transactions with global banks to offset the mismatch between floating-rate loans and fixed borrowing costs after RBI rate cuts.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/india-infra-lender-steps-up-derivatives-deals-with-global-banks",
    "source": "Bloomberg"
  },
  {
    "id": 30,
    "text": "Vodafone Idea considers debt funding after government caps spectrum payouts. Vodafone Idea may raise debt from local and global lenders after the government capped spectrum payouts, easing pressure on the telecom operator.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/vodafone-idea-is-said-to-consider-raising-debt-to-boost-growth",
    "source": "Bloomberg"
  },
  {
    "id": 31,
    "text": "Musk’s Grok limits image generation to paid users on X. Musk's Grok restricts image generation to paid users on X after backlash over explicit content, prompting EU document retention order.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/musk-s-grok-limits-image-generation-to-paid-users-on-x",
    "source": "Bloomberg"
  },
  {
    "id": 32,
    "text": "India’s economy at risk from higher tariffs, says former CEA. India also faces pressure from what Arvind Subramanian described as “Chinese mercantilism,” as it rapidly exports and diverts goods to developing countries, including India, weighing on the domestic economy",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/india-s-economy-at-risk-from-higher-tariffs-says-former-adviser",
    "source": "Bloomberg"
  },
  {
    "id": 33,
    "text": "LG Energy sees surprise loss as EV demand outlook cools. The upheaval has been particularly acute in the US, where President Donald Trump has scrapped a federal tax credit for EV purchases and plans to significantly weaken fuel efficiency requirements",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/lg-energy-sees-surprise-fourth-quarter-loss-as-ev-demand-slows",
    "source": "Bloomberg"
  },
  {
    "id": 34,
    "text": "TCS, Infosys to offer clues on 2026 demand as street estimates look up. The October-December quarter is typically weak for Indian IT companies because of fewer working days and furloughs, which weigh on both revenue and margins",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/tcs-infosys-to-offer-clues-on-2026-demand-as-street-estimates-look-up",
    "source": "Bloomberg"
  },
  {
    "id": 35,
    "text": "Trump signals land strikes on cartels after Maduro operation. Trump announces military strikes against drug cartels, following recent operations against Venezuelan leader Maduro and ongoing narcoterrorism efforts.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-09/trump-singals-land-strikes-on-cartels-after-maduro-operation",
    "source": "Bloomberg"
  },
  {
    "id": 36,
    "text": "India, Germany near $8-billion submarine deal ahead of Merz’s visit. Germany and India are hammering out the details of a submarine manufacturing deal worth at least $8 billion — the largest-ever defence agreement for New Delhi, according to officials with direct knowledge of the details.",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-08/germany-and-india-on-verge-of-8-billion-submarine-agreement",
    "source": "Bloomberg"
  },
  {
    "id": 37,
    "text": "US unveils strategy on Venezuelan oil, spurring rush for access. Trump said in a New York Times interview that the US would be running Venezuela and extracting its oil for years; “We will rebuild it in a very profitable way,” he told the newspaper",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-07/traders-and-refiners-eye-venezuelan-oil-as-us-plans-take-shape",
    "source": "Bloomberg"
  },
  {
    "id": 38,
    "text": "US will exit 66 international climate organizations, says Trump. Trump’s actions are in line with his domestic policy changes aimed at removing curbs on pollution and fossil fuels, and follow a decision in January 2025 to begin a year-long process to quit the Paris Agreement",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-08/trump-expands-us-climate-retreat-with-exits-from-un-bodies",
    "source": "Bloomberg"
  },
  {
    "id": 39,
    "text": "Blackout reveals German vulnerability to infrastructure attacks. While investigators so far have not identified a direct link to Moscow, the logic behind the hybrid attack on Berlin’s energy infrastructure fits into Russia’s playbook of destabilizing the democratic order",
    "category": "business",
    "url": "https://www.bloomberg.com/news/articles/2026-01-06/blackout-reveals-german-vulnerability-to-infrastructure-attacks",
    "source": "Bloomberg"
  },
  {
    "id": 0,
    "text": "\"It's An Absolute Destroyer Of The Quality Of Life\": Women Are Sharing The \"Brutal\" Realities Of Being A Woman That Men Are Completely, Utterly, And Pathetically Ignorant Toward. \"Even if we're talking on a dating app, it's incredibly jarring if your penis joins the chat without an invitation.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/abbyzinman/women-things-men-dont-get",
    "source": "Buzzfeed"
  },
  {
    "id": 1,
    "text": "Sophie Turner Opened Up About Becoming A Parent In Her Early 20s And Said It’s “Really Nice” To Not Have To Worry About Her “Biological Clock”. “I’ve had to try to rebuild, in a way. You don’t realize how important momentum is in a career, and I stalled it a bit.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/sophie-turner-opens-up-about-motherhood-in-her-20s",
    "source": "Buzzfeed"
  },
  {
    "id": 2,
    "text": "Ashton Kutcher Opened Up About Undergoing A Huge Physical Transformation For An Upcoming TV Role, So Here’s A Before And After Pic. “We made a comment at one point, and people were like, ‘Does he stink? Does he smell?’”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/ashton-kutcher-recalls-backlash-family-bathing-habits-mila",
    "source": "Buzzfeed"
  },
  {
    "id": 3,
    "text": "People Who Work In \"Boring\" Industries Are Sharing The Surprising Drama That Happens Behind The Scenes, And It's Juicy. \"The amount of inter-office affairs and drama we see just by recovering 'lost emails' is unreal. We literally have a betting pool on which executive gets divorced next.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hannahdobro/behind-the-scenes-secrets-from-boring-jobs",
    "source": "Buzzfeed"
  },
  {
    "id": 4,
    "text": "\"Can't Imagine My Life Without It\": 27 Cheap Habits That Frugal People Say Have Completely Transformed Their Days. \"This saves so much time and money.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/meganeliscomb/cheap-habits-that-improve-quality-of-life-fs",
    "source": "Buzzfeed"
  },
  {
    "id": 5,
    "text": "\"You Never Find It On A Menu Anymore\": People Over 30 Are Sharing The Once-Popular Foods That Have \"Mysteriously Vanished\" From Society Without Anyone Even Realizing. \"It used to be available both in restaurants and in the freezer sections. Now I never see it in either.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/abbyzinman/food-trends-that-have-disappeared-2",
    "source": "Buzzfeed"
  },
  {
    "id": 6,
    "text": "Which Taylor Swift Era Matches Your Favorite \"Harry Potter\" Characters?. Believe it or not, I actually don't think I'd put Draco Malfoy with \"Reputation.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/gryffinpuff20/every-harry-potter-character-has-a-taylor-swift-er",
    "source": "Buzzfeed"
  },
  {
    "id": 7,
    "text": "If You Have A Dog Who Hates Cold, Rainy, Or Windy Weather, You'll Want These 24 Things. For the conflicted floofs that want their walkies and to never leave their blanket nest again.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ashleyschumacher/products-dog-hates-cold-rainy-windy-winter",
    "source": "Buzzfeed"
  },
  {
    "id": 8,
    "text": "Here’s How Colin Jost Reacted To His Wife, Scarlett Johansson, Getting Dethroned As Hollywood’s Highest-Grossing Actor By Zoe Saldaña. “I like that he can make fun of himself for being less successful than his wife instead of feeling emasculated by it.”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/leylamohammed/colin-jost-scarlett-johansson-dethroned-highest-actor",
    "source": "Buzzfeed"
  },
  {
    "id": 9,
    "text": "People Are Sharing Their \"Wow, I Never Could've Predicted This\" Sex Stories, And It's Extremelyyy Juicy. \"We had the most amazing night I've ever had. I thought it was a one-time thing, but it never stopped. We've been together for 8 years and married for 6.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/abbyzinman/unexpected-wild-sex-stories",
    "source": "Buzzfeed"
  },
  {
    "id": 10,
    "text": "If You Haven’t Treated Yourself In A Hot Second — Might I Persuade You To Try These 32 Self-Care Items. Because you've been saying “I’ll relax later” for weeks now.",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/chelseastuart/self-care-items-to-treat-yourself-to",
    "source": "Buzzfeed"
  },
  {
    "id": 11,
    "text": "Malachi Kirby Talks \"A Thousand Blows\", Black Excellence, And Life In Victorian London. \"We don’t know that all these characters met, but we know they existed in the same place – they could have met. It’s rooted in reality; a version of this would have happened to real people.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hanifahrahman/malachi-kirby-talks-a-thousand-blows",
    "source": "Buzzfeed"
  },
  {
    "id": 12,
    "text": "Here Are The Two “Saturday Night Live” Jokes That Have Left People Seriously Mad At Finn Wolfhard And Caleb McLaughlin From “Stranger Things”. “Our society is so comfortable with degradation of women’s bodies. I am expected to hear this and be a ‘good sport.’”View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/stephaniesoteriou/finn-wolfhard-caleb-mclaughlin-misogynistic-snl-jokes",
    "source": "Buzzfeed"
  },
  {
    "id": 13,
    "text": "40 Hilariously Struggling Parents Who Would NEVER Tell People Without Kids They Need To Reproduce. Having kids ain't for the weak...View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/mikespohr/40-deeply-unlucky-parents",
    "source": "Buzzfeed"
  },
  {
    "id": 14,
    "text": "\"It's A Total Waste\": 17 \"Most Hated\" Modern Design Trends That Make Guests Instantly Judge Your Home. \"Ridiculously huge islands. You will never seat eight people there — unless your house is a diner.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/lizmrichardson/modern-home-design-trends-people-hate-january-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 15,
    "text": "Here Are The Most Jaw-Dropping, Terrible, And Dark Things I Learned This Week. An alleged grave robber in Pennsylvania, Macaulay Culkin's traumatic \"My Girl\" experience, and the \"Stocking Strangler.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/crystalro/100-bones-macaulay-culkin-that-got-dark-january-18",
    "source": "Buzzfeed"
  },
  {
    "id": 16,
    "text": "\"It Is Shocking How Many Grown Adults Don’t Wash Their Ass Properly\": 17 On-The-Job Confessions And Secrets From Professionals Who Look At Other People's Genitals On A Daily Basis. These are, honestly, oddly comforting.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/angelicaamartinez/waxers-obgyns-professionals-confessions-and-secrets",
    "source": "Buzzfeed"
  },
  {
    "id": 17,
    "text": "\"It's Been A Game-Changer\": 23 Frugal People Shared The One Practice That Saved Them The Most Money Last Year, And Everyone Should Write These Down. Perhaps everyone going back to their natural hair color is the new recession indicator.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alanavalko/frugal-habits-to-do-in-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 18,
    "text": "33 Highly Controversial Wedding Opinions That Range From \"Cake Is Overrated!\" To \"Let This Archaic Institution DIE!\". \"Don't make the bridal party pay for their ugly dresses!\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hannahdobro/brutally-honest-wedding-hot-takes",
    "source": "Buzzfeed"
  },
  {
    "id": 19,
    "text": "29 People Just Revealed How They Really Feel About The United States, And I'm Stressed TF Out. \"I mourn the American childhood my son will never haveView Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/mychalthompson/how-people-feel-about-state-of-america",
    "source": "Buzzfeed"
  },
  {
    "id": 20,
    "text": "People Who Had Sex With A Coworker Are Confessing Their Wildest Stories, And It's An HR Nightmare. \"I slept with a coworker who I was infatuated with. We were always intensely flirting and play-fighting. One time, it turned into her going down on me in the basement of the restaurant we worked at; she was pregnant at the time.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ajanibazile/people-who-had-forbidden-sex-with-someone-at-work-are",
    "source": "Buzzfeed"
  },
  {
    "id": 21,
    "text": "If You've Got At Least Two Dogs Running Around Your Home, Check Out These 30 Useful Chewy Products. Between my two dogs (and usually a foster puppy, too), I've figured out which products make multi-dog life manageable.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/samantharumore/if-youve-got-at-least-two-dogs-running-around-your-home",
    "source": "Buzzfeed"
  },
  {
    "id": 22,
    "text": "My Entire Body Is In Pain From Laughing At These Black Twitter Tweets That Absolutely Destroyed Me This Week. \"My mom asked my little sister what she even does to help around the house and she said 'I represent the family. I’m at school everyday honoring the family name.'\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/michaelabramwell/funniest-black-twitter-tweets-from-the-week-jan-18",
    "source": "Buzzfeed"
  },
  {
    "id": 23,
    "text": "Here Are The Absolute Funniest Weekend Tweets. \"overheard my wife tell our cat to 'go find something to do'\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/chelseastewart/funny-weekend-tweets-january-18-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 24,
    "text": "\"It's A Fire Waiting To Happen\": 16 \"Fatal\" Home Safety Mistakes You're Probably Making Every Day, Straight From First Responders. \"DON'T charge your phone in bed. It can heat up on your bedding and catch fire more easily than you might think!\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/lizmrichardson/first-responders-home-safety-mistakes",
    "source": "Buzzfeed"
  },
  {
    "id": 25,
    "text": "POP MART Opens Second Official Store At SM Aura. POP MART Opens Second Official Store at SM Aura Fresh from the opening of its first official store at SM Megamall, POP MART is adding another stop to Metro Manila’s retail map—this time in the heart of Bonifacio Global City.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bfeedasia/pop-mart-opens-second-official-store-at-sm-aura",
    "source": "Buzzfeed"
  },
  {
    "id": 26,
    "text": "People Are Sharing Which Design Trends Already Feel Dated, And Modern Farmhouses Are Causing Drama. From open floor plans and gray floors to farmhouse finishes and faux marble, homeowners and designers are debating which popular looks will age the fastest.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/victoriavouloumanos/intertior-design-trends-that-will-be-dated-soon",
    "source": "Buzzfeed"
  },
  {
    "id": 27,
    "text": "32 Of The Biggest, Most Off-Putting Icks That Helped People Get Over Their Exes Literally Over Night. \"I especially don't miss having to wipe pee off the bathroom floor and facial hair out of the sink.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/hannahdobro/relationship-icks-helped-exes-move-on",
    "source": "Buzzfeed"
  },
  {
    "id": 28,
    "text": "\"That's The Way We Make Things Better\": I'm Desperately Trying To Find The Silver Lining In 2026, So Here Are 23 Things That Actually Give Me The Tiniest Bit Of Hope For The US. What's this odd feeling I'm having right now? Could it be...hope?View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/kelley_greene/positive-things-happening-in-america-in-2026",
    "source": "Buzzfeed"
  },
  {
    "id": 29,
    "text": "\"I Was An Adult Film And Magazine Model\": People Are Sharing Secrets They'd Never Tell Their Partners, And They're High-Key Problematic. \"I want to run away overseas and never come back.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/mychalthompson/secrets-people-would-never-tell-partners",
    "source": "Buzzfeed"
  },
  {
    "id": 30,
    "text": "People Who've Worked With The Top 1% Are Sharing The \"Rich People Sh—\" They Saw That Most People Have Never Heard Of, And I'm Shook People Actually Live Like This. Very \"let them eat cake\" vibes.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/alanavalko/wild-rich-people-things",
    "source": "Buzzfeed"
  },
  {
    "id": 31,
    "text": "I Won't Sleep A Wink Tonight After Reading These Super, Super, Super, Super, Super, Super, Super, Super Terrifying Serial Killer Stories From Countries Outside America. \"I cut out a piece of his heart. I chewed it.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/crystalro/international-serial-killers",
    "source": "Buzzfeed"
  },
  {
    "id": 32,
    "text": "Married Women Are Calling Out The Wildest Examples Of \"Weaponized Incompetence\" From Their Own Husbands, And It's So, So, SO Bad. \"My ex-husband got so mad that I asked him to load the dishwasher that he literally THREW the stoneware plates into the bottom rack, breaking several.\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/lizmrichardson/women-call-out-husbands-weaponized-incompetence",
    "source": "Buzzfeed"
  },
  {
    "id": 33,
    "text": "If You're Dating Men In 2026, Then You Need To Look Out For These 18 Subtle Signs That A Man Is Red-Pilled. \"A sign that a guy is red-pilled is if he says, 'If we got married, you wouldn't have to work anymore.'\"View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/ajanibazile/red-pilled-men-signs",
    "source": "Buzzfeed"
  },
  {
    "id": 34,
    "text": "37 Travel Products To Help You Get From A To B With As Little Agony As Possible. Whether you're jet-setting across the globe or just walking through a new city, these handy, packable items have got your back.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bekoconnell/travel-products-help-you-get-from-a-to-b-an",
    "source": "Buzzfeed"
  },
  {
    "id": 35,
    "text": "Expect Endless Compliments With These 29 Pieces From Free People. Reminder: no gatekeeping when you get asked where you got it from — it will happen!View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/flaviacnunez/expect-endless-compliments-with-these-free-people-pieces",
    "source": "Buzzfeed"
  },
  {
    "id": 36,
    "text": "27 Valentine's Day Gifts From Uncommon Goods For Couples Who've Been Together So Long That They've Run Out Of Ideas. There's a lot of love left in this engine.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/bykitstone/valentines-day-gifts-from-uncommon-goods-for-couples",
    "source": "Buzzfeed"
  },
  {
    "id": 37,
    "text": "37 Surprisingly Affordable Products That Feel Like The Absolute Peak Of Decadence. The \"ooh la la\" factor of this Baccarat Rouge 540-inspired body wash and these $32 holy grail comfortable leggings cannot be overstated.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/emmalord9/peak-of-affordable-decadence",
    "source": "Buzzfeed"
  },
  {
    "id": 38,
    "text": "23 Dresses From Amazon That’ll Simplify The Process Of Getting Dressed This Winter. No pants required always makes things easier.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/isabellasarlija/dresses-from-amazon-thatll-simplify-winter-style-an",
    "source": "Buzzfeed"
  },
  {
    "id": 39,
    "text": "27 Beauty Products For Anyone Who Wants To Try Something New, But Doesn’t Want To Break The Bank. You are going to throw a loooot of expensive products overboard when you try this affordable eye-brightening rollerball and new \"slipstick\" lip lint.View Entire Post ›",
    "category": "entertainment",
    "url": "https://www.buzzfeed.com/emmalord9/beauty-products-new-bank",
    "source": "Buzzfeed"
  },
  {
    "id": 0,
    "text": "Aging muscles: How does exercise help prevent protein decline?. Scientists have discovered how exercise protects aging muscles by suppressing DEAF1, a molecule they identified as a driver of muscle decline.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/exercise-prevents-muscle-loss-aging-how-protein-biology",
    "source": "Medical News Today"
  },
  {
    "id": 1,
    "text": "To live longer, try cutting sitting time down by 30 minutes. As little as 5 extra minutes of moderate-to-vigorous physical activity each day could help prevent 6% of deaths among those who are the least active, a large new study has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/moving-just-5-more-minutes-each-day-could-boost-longevity",
    "source": "Medical News Today"
  },
  {
    "id": 2,
    "text": "New AI platform could help more cancer patients access clinical trials. Researchers at Mount Sinai launch a new AI platform to match more cancer patients with clinical trials, aiming to expand enrolment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/mount-sinai-ai-tool-aims-to-improve-access-to-cancer-clinical-trials",
    "source": "Medical News Today"
  },
  {
    "id": 3,
    "text": "Type 2 diabetes: Timing or type of menopause does not affect risk. The timing or type of menopause does not impact the risk of developing type 2 diabetes but certain health and lifestyle factors may, a new study finds.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/early-menopause-not-linked-higher-type-2-diabetes-risk",
    "source": "Medical News Today"
  },
  {
    "id": 4,
    "text": "Dementia: HRT for menopause does not increase risk. Hormone replacement therapy (HRT) to treat menopause symptoms does not increase dementia risk, according to a new study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/hrt-does-not-increase-dementia-risk-in-women",
    "source": "Medical News Today"
  },
  {
    "id": 5,
    "text": "Chat GPT Health: Expert take on AI’s role in modern medicine. Following the release of ChatGPT Health, due to an increased interest in AI-driven medical guidance, MNT discusses the role of AI health advice with AI-in-clinical-medicine expert David Liebovitz.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/is-chatgpt-health-the-future-of-ai-medical-advice",
    "source": "Medical News Today"
  },
  {
    "id": 6,
    "text": "Prostate cancer: Simple tool may help to spot metastatic cancer sooner. University Hospitals Seidman Cancer Center researchers have developed a tool that could identify metastatic prostate cancer earlier. This tool may help guide treatment, such as signalling when to intervene, intensify treatment, or enrol in trials.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/new-tool-can-help-identify-metastatic-prostate-cancer-risk-earlier",
    "source": "Medical News Today"
  },
  {
    "id": 7,
    "text": "Hypertension: More beige fat linked to better blood pressure control. Scientists have found that beige fat, unlike white fat, may actually help control blood pressure, via a study in mice, which could lead to new treatments for hypertension.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/beige-fat-may-help-regulate-blood-pressure-mice-study",
    "source": "Medical News Today"
  },
  {
    "id": 8,
    "text": "Crohn's disease: Low-calorie, plant-based diet may help. A form of very low-calorie fasting-mimicking diet may help alleviate symptoms of mild-to-moderate Crohn's disease.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/fasting-mimicking-diet-may-help-with-crohns-disease",
    "source": "Medical News Today"
  },
  {
    "id": 9,
    "text": "Type 2 diabetes, cancer: Common food preservatives may heighten risk. A number of commonly used food preservatives were linked to a higher risk of type 2 diabetes and many forms of cancer in two new studies from the same team.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/food-preservatives-linked-to-type-2-diabetes-and-cancer-studies-warn",
    "source": "Medical News Today"
  },
  {
    "id": 10,
    "text": "Food pyramid gets review with new US 2026 dietary guidelines. The new U.S. dietary guidelines call for prioritizing high-quality protein, healthy fats, and avoiding sugars and processed foods. Here's what experts think of these changes.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/4-key-changes-us-dietary-guidelines-prioritize-protein-full-fat-dairy",
    "source": "Medical News Today"
  },
  {
    "id": 11,
    "text": "Diabetes, kidney disease: Light exercise may help lower death risk. Light physical activity may help lower death risk in cardiovascular-kidney-metabolic syndrome, a condition that includes heart disease, kidney disease, obesity, and type 2 diabetes.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/walking-house-chores-may-help-lower-diabetes-heart-disease-death-risk",
    "source": "Medical News Today"
  },
  {
    "id": 12,
    "text": "Heart disease: High cholesterol linked to increased 30-year risk. A new study found that having higher lipoprotein(a) levels was linked to an increased 30-year risk for cardiovascular disease, even in healthy women.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/high-cholesterol-predict-future-heart-disease-risk-lipoprotein-healthy-women",
    "source": "Medical News Today"
  },
  {
    "id": 13,
    "text": "Supercentenarians: How can you live past 110?. Brazil holds a record number of supercentenarians, people who live healthy lives past 110. What is the secret to their longevity",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/many-brazilians-live-past-110-what-are-their-secrets",
    "source": "Medical News Today"
  },
  {
    "id": 14,
    "text": "Can exercise treat depression just as well as therapy?. Getting enough exercise, especially light to moderate intensity, may help reduce depression symptoms as effectively as psychological therapy, a new study suggests.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/exercise-may-reduce-depression-symptoms-as-effectively-as-therapy",
    "source": "Medical News Today"
  },
  {
    "id": 15,
    "text": "Blue Monday: Let us lay this mental health myth to rest. Blue Monday, the most depressing day of the year: Is there any science behind it, or is it just a myth that has gained too much momentum over time?",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/mental-health-myth-blue-monday-depression-sad-january",
    "source": "Medical News Today"
  },
  {
    "id": 16,
    "text": "Vascular dementia: Scientists find way to restore brain blood flow. Scientists have found that adding a missing phospholipid back into the bloodstream might help improve blood flow and reduce the symptoms of dementia, which could lead to a new treatment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/restoring-missing-lipid-ease-vascular-dementia-damage-brain-study",
    "source": "Medical News Today"
  },
  {
    "id": 17,
    "text": "Alzheimer's: Experimental treatment restores memory in mice. A new drug candidate shows promise by reversing cognitive decline in advanced Alzheimer's disease by restoring brain balance in an animal study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/experimental-drug-reverses-alzheimers-in-mice",
    "source": "Medical News Today"
  },
  {
    "id": 18,
    "text": "ADHD: Common Medications May Work Differently Than Previously Believed. A new study suggests that common medications prescribed to help manage ADHD, such as Adderall and Ritalin, may work differently than believed.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/adhd-stimulants-dont-work-the-way-we-thought-they-did",
    "source": "Medical News Today"
  },
  {
    "id": 19,
    "text": "Dementia: Disturbances to circadian rhythm may increase risk. The results of a recent study suggest that people with a weaker or more irregular body clock, also known as circadian rhythm, may have a higher risk of developing dementia.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/body-clock-disturbances-may-contribute-to-dementia-risk-evidence-suggests",
    "source": "Medical News Today"
  },
  {
    "id": 20,
    "text": "Colorectal cancer: 10-12 minute bursts of exercise may halt growth. A short burst of intense exercise — as little as 10 to 12 minutes — may be able to provide benefits such as slowing the growth of colorectal cancer cells, a new study has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/10-minutes-intense-exercise-may-treat-prevent-colorectal-cancer",
    "source": "Medical News Today"
  },
  {
    "id": 21,
    "text": "Breast cancer: Hot flash drug slows tumor growth even at low doses. Megestrol, which helps treat hot flashes associated with menopause, may have the added benefit of slowing the growth of ER-positive breast tumors, a new trial has found.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/hot-flash-treatment-menopause-slow-breast-cancer-growth-trial-megestrol-letrozole",
    "source": "Medical News Today"
  },
  {
    "id": 22,
    "text": "FDA approves first pill for weight loss: 5 things to know. MNT speaks with three obesity medicine experts to find out more about the FDA-aproved Wegovy pill and how it's different from the Wegovy injection.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/wegovy-weight-loss-pill-comparison-injections-side-effects-contraindications",
    "source": "Medical News Today"
  },
  {
    "id": 23,
    "text": "Dementia: 3 reasons poor sleep may increase risk. Medical News Today looks at three key studies and their key findings that highlight and further confirm the connection between how poor sleep increases dementia risk.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/sleep-quality-insomnia-sleep-apnea-increase-dementia-risk-latest-evidence",
    "source": "Medical News Today"
  },
  {
    "id": 24,
    "text": "Heart health: Should you get your B12 from diet or supplements?. Vitamin B12 is a vital nutrient that plays numerous key roles in maintaining health. It is available in different forms and can be found in both food and supplements. A recent review suggests that the natural version could be more beneficial.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/diet-vs-supplements-which-b12-form-is-better-for-health",
    "source": "Medical News Today"
  },
  {
    "id": 25,
    "text": "'Dry January': Can 1 month of no alcohol have a real effect on health?. Abstaining from alcohol for just one month as part of 'Dry January' can offer meaningful physical and psychological improvements, including better sleep, and weight loss, a new study confirms.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/dry-january-1-month-no-alcohol-difference-health-study",
    "source": "Medical News Today"
  },
  {
    "id": 26,
    "text": "Could these 7 behaviors help extend lifespan after a cancer diagnosis?. A study has found that people exercise regularly, quit smoking, and practice five other health strategies can improve their chances of living longer after cancer.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/7-heart-healthy-behaviors-help-increase-longevity-after-cancer",
    "source": "Medical News Today"
  },
  {
    "id": 27,
    "text": "Brain aging: Creative pursuits may help support brain health. Research suggests that individuals who partake in creative activities, such as arts and crafts, musical instruments, and gardening, typically have a more youthful brain on average.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/dancing-reading-and-video-games-could-help-delay-brain-aging",
    "source": "Medical News Today"
  },
  {
    "id": 28,
    "text": "Could probiotics help manage and prevent eczema and acne?. A review indicates that probiotic, prebiotic, and synbiotic supplements could be beneficial for skin health, especially for managing conditions such as eczema.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/supplements-that-support-gut-health-may-also-benefit-skin-health",
    "source": "Medical News Today"
  },
  {
    "id": 29,
    "text": "How much coffee should you drink for a long, healthy life?. Coffee may boost longevity and lower diabetes risk according to the latest research. Here is what the evidence tells us.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/roundup-coffee-and-longevity-3-studies-explore-how-coffee-may-benefit-healthy-aging",
    "source": "Medical News Today"
  },
  {
    "id": 30,
    "text": "Chronic pain: 5 healthy habits linked to 8 years younger brain. A few simple, healthy habits have been linked to 8 years younger brain, even in people with chronic pain.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/5-healthy-habits-may-help-keep-the-brain-younger-even-with-chronic-pain",
    "source": "Medical News Today"
  },
  {
    "id": 31,
    "text": "Anxiety, depression: Less social media use can improve symptoms. Recent research shows that reducing social media use for at least one week can lower rates of anxiety, depression, and insomnia in young adults.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/1-week-social-media-break-could-boost-mental-health",
    "source": "Medical News Today"
  },
  {
    "id": 32,
    "text": "Dementia: Driving habits could be a marker of brain health. Can driving patterns help predict cognitive decline later in life? A new study finds that certain changes in driving habits may point to mild cognitive impairment.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/changes-driving-patterns-predict-cognitive-decline-dementia",
    "source": "Medical News Today"
  },
  {
    "id": 33,
    "text": "Cardiovascular disease: How eating takeout may heighten risk. Research suggests a link between dietary plans high in takeout food and systemic inflammation. A new study highlights that those who eat greater amounts of takeout food are more likely to have elevated risk factors for heart disease.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/eating-takeout-too-often-may-increase-cardiovascular-risk",
    "source": "Medical News Today"
  },
  {
    "id": 34,
    "text": "Sleep vs exercise: How to strike the balance for health. Sleep is as important as exercise for health, new research emphasizes, advising that we first need proper rest in order to improve our physical activity.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/between-sleep-and-exercise-choose-sleep-research-suggests",
    "source": "Medical News Today"
  },
  {
    "id": 35,
    "text": "How orange juice could help support heart health. Drinking orange juice can help support health by reducing inflammation and hypertension, among other factors, a recent study suggests.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/orange-juice-could-help-support-heart-health",
    "source": "Medical News Today"
  },
  {
    "id": 36,
    "text": "Kimchi may help improve immune system and gut health. Eating the fermented food kimchi daily for 12 weeks may also help improve the immune system, in addition to its gut health benefits, a new study indicates.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/eating-kimchi-daily-probiotics-12-weeks-help-regulate-immune-system",
    "source": "Medical News Today"
  },
  {
    "id": 37,
    "text": "Mix of resveratrol and copper may help treat deadly brain cancer. A combination of two supplements — resveratrol and copper — reduced the aggressiveness of tumors in glioblastoma, a type of deadly brain cancer, in a small study.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/supplement-mix-resveratrol-copper-helps-reduce-tumor-aggressiveness-deadly-brain-cancer",
    "source": "Medical News Today"
  },
  {
    "id": 38,
    "text": "Which depression symptoms may predict dementia?. Six specific depression symptoms in midlife are linked to a higher risk of dementia, a new study shows.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/6-depression-symptoms-in-midlife-linked-to-almost-50-higher-dementia-risk",
    "source": "Medical News Today"
  },
  {
    "id": 39,
    "text": "Crohn's disease: Ultra-processed foods linked to higher risk. New research shows that diets high in ultra-processed foods may be connected to a higher risk of Crohn's disease.",
    "category": "health",
    "url": "https://www.medicalnewstoday.com/articles/ultra-processed-foods-and-crohns-disease-link",
    "source": "Medical News Today"
  }
]